In [2]:
import pandas as pd
df = pd.read_csv('04_gap-merged.tsv', sep ='\t')

Show the first 5 lines of tsv file.

In [5]:
print(df.head(5))

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

Find the number of row and column of this file.

In [9]:
num_rows, num_columns= df.shape
print ("Number of rows: ", num_rows)
print ("Number of columns: ", num_columns)

Number of rows:  3312
Number of columns:  6

Print the name of the columns.

In [14]:
print(df.columns)

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

What is the type of the column names?

In [16]:
print(df.dtypes)

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

Get the country column and save it to its own variable. Show the first 5 observations.

In [26]:
country_column = df['country']
print(country_column.head(5))

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

Show the last 5 observations of this column.

In [27]:
print(country_column.tail(5))

3307    Zimbabwe
3308    Zimbabwe
3309    Zimbabwe
3310    Zimbabwe
3311    Zimbabwe
Name: country, dtype: object

Look at country, continent and year. Show the first 5 observations of these columns, and the last 5 observations.

In [29]:
selected_columns = df[['country', 'continent', 'year']]
print (selected_columns.head(5))
print (selected_columns.tail(5))

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972
       country continent  year
3307  Zimbabwe    Africa  1987
3308  Zimbabwe    Africa  1992
3309  Zimbabwe    Africa  1997
3310  Zimbabwe    Africa  2002
3311  Zimbabwe    Africa  2007

How to get the first row of tsv file? How to get the 100th row.

In [32]:
print("The first row of df: \n", df.iloc[0])
print("The 100th row of df: \n", df.iloc[99])

The first row of df:
 country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object
The 100th row of df:
 country        Australia
continent            NaN
year                1977
lifeExp            73.49
pop             14074100
gdpPercap    18334.19751
Name: 99, dtype: object

Try to get the first column by using a integer index. And get the first and last column by passing the integer index.

In [33]:
first_column = df.iloc[:, 0]
first_and_last_columns = df.iloc[:, [0, -1]]
print("First column:")
print(first_column)
print("\nFirst and last columns:")
print(first_and_last_columns)

First column:
0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
3307       Zimbabwe
3308       Zimbabwe
3309       Zimbabwe
3310       Zimbabwe
3311       Zimbabwe
Name: country, Length: 3312, dtype: object

First and last columns:
          country   gdpPercap
0     Afghanistan  779.445314
1     Afghanistan  820.853030
2     Afghanistan  853.100710
3     Afghanistan  836.197138
4     Afghanistan  739.981106
...           ...         ...
3307     Zimbabwe  706.157306
3308     Zimbabwe  693.420786
3309     Zimbabwe  792.449960
3310     Zimbabwe  672.038623
3311     Zimbabwe  469.709298

[3312 rows x 2 columns]

How to get the last row with .loc? Try with index -1? Correct?

In [38]:
last_row = df.loc[-1]

# Display the last row
print("Last row:")
print(last_row)

KeyError: -1

How to select the first, 100th, 1000th rows by two methods?

In [8]:
# Method 1: Using .iloc
first_row_iloc = df.iloc[0]
hundredth_row_iloc = df.iloc[99]
thousandth_row_iloc = df.iloc[999]
print (first_row_iloc)
print(hundredth_row_iloc)
print(thousandth_row_iloc)
print ('-----------------------------------------')
# Method 2: Using .loc
first_row_loc = df.loc[df.index[0]]
hundredth_row_loc = df.loc[df.index[99]]
thousandth_row_loc = df.loc[df.index[999]]
print (first_row_loc)
print(hundredth_row_loc)
print(thousandth_row_loc)

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object
country        Australia
continent            NaN
year                1977
lifeExp            73.49
pop             14074100
gdpPercap    18334.19751
Name: 99, dtype: object
country         Finland
continent        Europe
year               1964
lifeExp           69.37
pop             4548544
gdpPercap    10042.2193
Name: 999, dtype: object
-----------------------------------------
country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object
country        Australia
continent            NaN
year                1977
lifeExp            73.49
pop             14074100
gdpPercap    18334.19751
Name: 99, dtype: object
country         Finland
continent        Europe
year               1964
lifeExp           69.37
pop             4548544
gdpPercap    10042.2193
Name: 999, dtype: object

Get the 43rd country in our data using .loc, .iloc?

In [14]:
selected_item_43rd_country_iloc = df.iloc[42]
selected_item_43rd_country_loc = df.loc[df.index[42]]
print (selected_item_43rd_country_iloc)
print (selected_item_43rd_country_loc)

country           Angola
continent         Africa
year                1982
lifeExp           39.942
pop              7016384
gdpPercap    2756.953672
Name: 42, dtype: object
country           Angola
continent         Africa
year                1982
lifeExp           39.942
pop              7016384
gdpPercap    2756.953672
Name: 42, dtype: object

How to get the first, 100th, 1000th rows from the first, 4th and 6th columns?

In [17]:
selected_row_col_iloc = df.iloc[[0, 99, 999], [0,3,5]]
print (selected_row_col_iloc)

selected_row_col_loc = df.loc[[0, 99, 999], ['country','lifeExp','gdpPercap']] # chỉ có thể dùng được khi định nghĩa tên cột
print (selected_row_col_loc)

         country  lifeExp     gdpPercap
0    Afghanistan   28.801    779.445314
99     Australia   73.490  18334.197510
999      Finland   69.370  10042.219300
         country  lifeExp     gdpPercap
0    Afghanistan   28.801    779.445314
99     Australia   73.490  18334.197510
999      Finland   69.370  10042.219300

Get first 10 rows of our data (tsv file)?

In [18]:
print(df.head(10))

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

For each year in our data, what was the average life expectation?

In [21]:
average_life_expectation_per_year = df.groupby('year')['lifeExp'].mean()
print(average_life_expectation_per_year)

year
1950    62.002568
1951    65.904167
1952    49.206867
1953    66.674563
1954    67.459817
1955    67.806757
1956    67.950637
1957    51.614590
1958    68.815936
1959    68.226579
1960    68.470837
1961    68.862480
1962    54.035234
1963    69.595735
1964    70.063105
1965    70.259881
1966    70.447526
1967    56.263629
1968    70.689081
1969    70.653896
1970    70.961141
1971    71.103976
1972    58.474481
1973    71.500338
1974    71.778504
1975    71.939218
1976    72.158050
1977    60.429090
1978    72.717567
1979    73.018717
1980    73.064524
1981    73.337399
1982    62.365871
1983    73.787778
1984    74.100741
1985    74.112222
1986    74.452222
1987    63.984860
1988    74.760000
1989    74.924444
1990    74.283438
1991    74.374848
1992    65.008443
1993    74.324545
1994    74.456667
1995    74.552727
1996    75.029394
1997    65.873799
1998    75.569697
1999    75.703636
2000    76.026364
2001    76.257879
2002    66.835695
2003    76.586667
2004    76.921562
2005    76.718667
2006    77.887778
2007    67.868557
Name: lifeExp, dtype: float64

Using subsetting method for the solution of 15/?

In [24]:
unique_years = df['year'].unique()
for year in unique_years:
    subset_for_year = df[df['year']==year]
    average_life_expectancy_for_year = subset_for_year['lifeExp'].mean()
    print(f"Average life expectancy in {year}: {average_life_expectancy_for_year}")

Average life expectancy in 1952: 49.206867132867124
Average life expectancy in 1957: 51.61459
Average life expectancy in 1962: 54.03523417218543
Average life expectancy in 1967: 56.26362897435898
Average life expectancy in 1972: 58.47448142857142
Average life expectancy in 1977: 60.429089824561416
Average life expectancy in 1982: 62.36587134502924
Average life expectancy in 1987: 63.9848596491228
Average life expectancy in 1992: 65.00844262295082
Average life expectancy in 1997: 65.87379891304347
Average life expectancy in 2002: 66.83569518716577
Average life expectancy in 2007: 67.86855737704919
Average life expectancy in 1950: 62.00256820512819
Average life expectancy in 1951: 65.90416666666667
Average life expectancy in 1953: 66.67456333333332
Average life expectancy in 1954: 67.45981666666665
Average life expectancy in 1955: 67.80675666666667
Average life expectancy in 1956: 67.95063666666667
Average life expectancy in 1958: 68.815936
Average life expectancy in 1959: 68.2265792
Average life expectancy in 1960: 68.47083692307693
Average life expectancy in 1961: 68.86247999999999
Average life expectancy in 1963: 69.59573538461538
Average life expectancy in 1964: 70.06310461538462
Average life expectancy in 1965: 70.25988148148149
Average life expectancy in 1966: 70.44752592592593
Average life expectancy in 1968: 70.68908148148148
Average life expectancy in 1969: 70.6538962962963
Average life expectancy in 1970: 70.96114074074075
Average life expectancy in 1971: 71.1039762962963
Average life expectancy in 1973: 71.5003375
Average life expectancy in 1974: 71.77850370370369
Average life expectancy in 1975: 71.93921777777777
Average life expectancy in 1976: 72.15805037037038
Average life expectancy in 1978: 72.7175674074074
Average life expectancy in 1979: 73.01871703703704
Average life expectancy in 1980: 73.06452444444446
Average life expectancy in 1981: 73.3373985185185
Average life expectancy in 1983: 73.78777777777779
Average life expectancy in 1984: 74.10074074074073
Average life expectancy in 1985: 74.11222222222221
Average life expectancy in 1986: 74.4522222222222
Average life expectancy in 1988: 74.76
Average life expectancy in 1989: 74.92444444444443
Average life expectancy in 1990: 74.2834375
Average life expectancy in 1991: 74.37484848484848
Average life expectancy in 1993: 74.32454545454546
Average life expectancy in 1994: 74.45666666666668
Average life expectancy in 1995: 74.55272727272728
Average life expectancy in 1996: 75.02939393939393
Average life expectancy in 1998: 75.56969696969696
Average life expectancy in 1999: 75.70363636363636
Average life expectancy in 2000: 76.02636363636363
Average life expectancy in 2001: 76.2578787878788
Average life expectancy in 2003: 76.58666666666666
Average life expectancy in 2004: 76.9215625
Average life expectancy in 2005: 76.71866666666666
Average life expectancy in 2006: 77.88777777777779

Create a series with index 0 for ‘banana’ and index 1 for ’42’?

In [25]:
my_series = pd.Series(['banana', '42'], index = [0,1])
print(my_series)

0    banana
1        42
dtype: object

Similar to 17, but change index ‘Person’ for ‘Wes MCKinney’ and index ‘Who’ for ‘Creator of Pandas’?

In [27]:
my_series = pd.Series(['Wes MCKinney', 'Creator of Pandas'], index = ['Person', 'Who'])
print(my_series)

Person         Wes MCKinney
Who       Creator of Pandas
dtype: object

Create a dictionary for pandas with the data as ‘Occupation’: [’Chemist’, ’Statistician’], ’Born’: [’1920-07-25’, ’1876-06-13’],’Died’: [’1958-04-16’, ’1937-10-16’],’Age’: [37, 61] and the index is ‘Franklin’,’Gosset’ with four columns as indicated.

In [3]:
import pandas as pd
data = {
    'Occupation': ['Chemist', 'Statistician'],
    'Born' : ['1920-07-25', '1876-06-13'],
    'Died' : ['1958-04-16', '1937-10-16'],
    'Age':[37, 61]
}
index = ['Franklin', 'Gosset']
df = pd.DataFrame(data, index = index)
print (df)

            Occupation        Born        Died  Age
Franklin       Chemist  1920-07-25  1958-04-16   37
Gosset    Statistician  1876-06-13  1937-10-16   61

In [1]:
import pandas as pd
diameters = [4879, 12104, 12756, 6792, 142984, 120536, 51118, 49528]
diameters_series  = pd.Series(diameters)
print (diameters_series)

0      4879
1     12104
2     12756
3      6792
4    142984
5    120536
6     51118
7     49528
dtype: int64

In [2]:
diameters = [4879, 12104, 12756, 6792, 142984, 120536, 51118, 49528]
Index = ["Mercury", "Venus", "Earth", "Mars", "Jupyter", "Saturn", "Uranus", "Neptune"]
data_dia_planet = pd.Series(diameters, Index)
print (Data_planet)

NameError: name 'Data_planet' is not defined

In [3]:
# print diameter of Earth planet
data_dia_planet['Earth']

12756

In [4]:
data_dia_planet['Mercury' : 'Mars']

Mercury     4879
Venus      12104
Earth      12756
Mars        6792
dtype: int64

In [5]:
data_dia_planet[['Earth', 'Jupyter', 'Neptune']]

Earth       12756
Jupyter    142984
Neptune     49528
dtype: int64

In [6]:
data_dia_planet['Pluto'] = 2370
data_dia_planet.to_csv('diameters.csv', header = ['Diameter'])
print(data_dia_planet)

Mercury      4879
Venus       12104
Earth       12756
Mars         6792
Jupyter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [7]:
import pandas as pd

data = {
    'diameter': [4879, 12104, 12756, 6792, 142984, 120536, 51118, 49528, 2370],
    'avg_temp': [167, 464, 15, -65, -110, -140, -195, -200, -225],
    'gravity': [3.7, 8.9, 9.8, 3.7, 23.1, 9.0, 8.7, 11.0, 0.7]
}

index = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto']

planets = pd.DataFrame(data, index=index)

print(planets)

         diameter  avg_temp  gravity
Mercury      4879       167      3.7
Venus       12104       464      8.9
Earth       12756        15      9.8
Mars         6792       -65      3.7
Jupiter    142984      -110     23.1
Saturn     120536      -140      9.0
Uranus      51118      -195      8.7
Neptune     49528      -200     11.0
Pluto        2370      -225      0.7

In [8]:
planets[0:3]

         diameter  avg_temp  gravity
Mercury      4879       167      3.7
Venus       12104       464      8.9
Earth       12756        15      9.8

In [9]:
planets.iloc[-2:]

         diameter  avg_temp  gravity
Neptune     49528      -200     11.0
Pluto        2370      -225      0.7

In [10]:
planets.columns

Index(['diameter', 'avg_temp', 'gravity'], dtype='object')

In [11]:
planets['gravity']

Mercury     3.7
Venus       8.9
Earth       9.8
Mars        3.7
Jupiter    23.1
Saturn      9.0
Uranus      8.7
Neptune    11.0
Pluto       0.7
Name: gravity, dtype: float64

In [12]:
planets[['diameter','gravity']]

         diameter  gravity
Mercury      4879      3.7
Venus       12104      8.9
Earth       12756      9.8
Mars         6792      3.7
Jupiter    142984     23.1
Saturn     120536      9.0
Uranus      51118      8.7
Neptune     49528     11.0
Pluto        2370      0.7

In [18]:
planets.gravity.loc['Earth']

3.7

In [19]:
planets.loc['Earth', ['diameter', 'gravity']]

diameter    12756.0
gravity         9.8
Name: Earth, dtype: float64

In [20]:
planets.loc['Earth' : 'Saturn', ['diameter', 'gravity']]

         diameter  gravity
Earth       12756      9.8
Mars         6792      3.7
Jupiter    142984     23.1
Saturn     120536      9.0

In [26]:
planets['diameter']>1000

Mercury    True
Venus      True
Earth      True
Mars       True
Jupiter    True
Saturn     True
Uranus     True
Neptune    True
Pluto      True
Name: diameter, dtype: bool

In [24]:
planets[planets['diameter']>100000]

         diameter  avg_temp  gravity
Jupiter    142984      -110     23.1
Saturn     120536      -140      9.0

In [27]:
planets[(planets['gravity']>5) & (planets['avg_temp']>0)]

       diameter  avg_temp  gravity
Venus     12104       464      8.9
Earth     12756        15      9.8

In [28]:
planets.sort_values('diameter')

         diameter  avg_temp  gravity
Pluto        2370      -225      0.7
Mercury      4879       167      3.7
Mars         6792       -65      3.7
Venus       12104       464      8.9
Earth       12756        15      9.8
Neptune     49528      -200     11.0
Uranus      51118      -195      8.7
Saturn     120536      -140      9.0
Jupiter    142984      -110     23.1

In [31]:
planets.sort_values('gravity', ascending=False)

         diameter  avg_temp  gravity
Jupiter    142984      -110     23.1
Neptune     49528      -200     11.0
Earth       12756        15      9.8
Saturn     120536      -140      9.0
Venus       12104       464      8.9
Uranus      51118      -195      8.7
Mercury      4879       167      3.7
Mars         6792       -65      3.7
Pluto        2370      -225      0.7

In [43]:
planets.sort_values(by = 'Mercury', axis = 1)

         gravity  avg_temp  diameter
Mercury      3.7       167      4879
Venus        8.9       464     12104
Earth        9.8        15     12756
Mars         3.7       -65      6792
Jupiter     23.1      -110    142984
Saturn       9.0      -140    120536
Uranus       8.7      -195     51118
Neptune     11.0      -200     49528
Pluto        0.7      -225      2370